Revit 2024 API
MEPSupportUtils Class
 General utility methods for the Autodesk Revit MEP Supporting components.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static class MEPSupportUtils
Visual Basic
Public NotInheritable Class MEPSupportUtils
Visual C++
public ref class MEPSupportUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPSupportUtils
See Also
MEPSupportUtils Members
Autodesk.Revit.DB Namespace